sonicFoam/sod_shock_tube/sod_shock_tube/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)
    (0 0 1)
    (1 0 1)
    (1 1 1)
    (0 1 1)
);

blocks
(
    //hex (0 1 2 3 4 5 6 7) (10000 1 1) simpleGrading (1 1 1)
    hex (0 1 2 3 4 5 6 7) (5000 1 1) simpleGrading (1 1 1)
    //hex (0 1 2 3 4 5 6 7) (1000 1 1) simpleGrading (1 1 1)
    //hex (0 1 2 3 4 5 6 7) (100 1 1) simpleGrading (1 1 1)
    //hex (0 1 2 3 4 5 6 7) (20 1 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    sides
    {
        type patch;
        faces
        (
            (1 2 6 5)
            (0 4 7 3)
        );
    }
    emptywalls
    {
        type empty;
        faces
        (
            (0 1 5 4)
            (5 6 7 4)
            (3 7 6 2)
            (0 3 2 1)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //

