sonicFoam/sod_shock_tube/sod_shock_tube/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(p|U|e|h).*"
    {
/*
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
*/

        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;

/*
        solver          GAMG;
	smoother 	symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
*/

	minIter		2;
    }

    "rho.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-8;
        relTol          0;
    }
}

PIMPLE
{
    //momentumPredictor 	yes;	//hardwired to yes in OF
    consistent 		yes; 	

    transonic yes;

    nOuterCorrectors     2;		
    nCorrectors          2;		
    nNonOrthogonalCorrectors 1;		

//D commented
/*
    outerCorrectorResidualControl
    {
        //"(p|U|e|h)"
        ".*"
        {
            relTol          0.01;	//0.01-0.001
            tolerance       0.001;	//0.001-0.0001
        }
    }
*/

}

//D commented
//URF adds oscillations in this case
/*
relaxationFactors
{
    fields
    {
        ".*"   0.7;  // ensure diagonal equality
    }
    equations
    {
        ".*"   0.7;  // ensure diagonal equality
    }
}
*/

// ************************************************************************* //
